/*
Удалить дубликаты
  - Создайте массив из чисел [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 2, 4, 6, 8, 10, 1, 3, 5, 7, 9];
  - Напишите скрипт, который убирает из массива дубликаты
  - При удалении дубликата, длина массива должна уменьшаться

  Присвойте результат в переменную "unique"
*/

let matrix = [1, 2, 3, 4, 5, 5, 6, 7, 8, 9, 10, 2, 4, 6, 8, 10, 1, 3, 5, 7, 9];
for (let i = 0; i < matrix.length - 1; i++) {
  for (let j = matrix.length - 1; j > i; j--) {
      if (matrix[j] == matrix[i]) {
        matrix.splice(j, 1);
      }
  }
}

let unique = matrix;
// console.log(unique);

export { unique };
